validation/polydisperseBubbleFoam/Delft/Delft_2_poly/system/momentGenerationDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      momentGenerationDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases
(
    air
);

boundaries
{
    inlet
    {
        type    fixedValue;
        value   uniform 0;
    }
    outlet
    {
        type    zeroGradient;
    }
    defaultFaces
    {
        type    empty;
    }
    walls
    {
        type    zeroGradient;
    }
}

air
{
    type                alphaAndDiameter;
    Radau               false;
    weightDimension     [0 -3 0 0 0 0 0];
    abscissaDimension   [1 0 0 0 0 0 0];

    internal
    {

        node0
        {
            rho rho [1 -3 0 0 0 0 0] 1.40;
            dia dia [0 1 0 0 0 0 0] 3.5e-3;
            alpha alpha [0 0 0 0 0 0 0] 0.33;
        }
        node1
        {
            rho rho [1 -3 0 0 0 0 0] 1.40;
            dia dia [0 1 0 0 0 0 0] 4.25e-3;
            alpha alpha [0 0 0 0 0 0 0] 0.34;
        }
        node2
        {
            rho rho [1 -3 0 0 0 0 0] 1.40;
            dia dia [0 1 0 0 0 0 0] 5.0e-3;
            alpha alpha [0 0 0 0 0 0 0] 0.33;
        }
    }
    inlet
    {
        node0
        {
            rho rho [1 -3 0 0 0 0 0] 1.40;
            dia dia [0 1 0 0 0 0 0] 3.5e-3;
            alpha alpha [0 0 0 0 0 0 0] 0.0253;
        }
        node1
        {
            rho rho [1 -3 0 0 0 0 0] 1.40;
            dia dia [0 1 0 0 0 0 0] 4.25e-3;
            alpha alpha [0 0 0 0 0 0 0] 0.0254;
        }
        node2
        {
            rho rho [1 -3 0 0 0 0 0] 1.40;
            dia dia [0 1 0 0 0 0 0] 5.0e-3;
            alpha alpha [0 0 0 0 0 0 0] 0.0253;
        }
    }
}


// ************************************************************************* //
